// src/data/events.js

const events = [
     {
    date: "٢٩ أبريل ٢٠٢٤",
    title: "أول رد على الستوري",
    description: "من هنا بدأت القصة. كانت مجرد كلمات بسيطة، لكنها فتحت بابًا لعالم كامل لم أكن أتوقعه.",
    media: {
      type: "image",
      source: "/images/event1.jpg", 
    },
  },
  {

    date: "١٦ مايو ٢٠٢٤",
    title: "أول نقاش بيننا",
    description: "في ذلك اليوم، اكتشفت عمق أفكارك وطريقة رؤيتك للأمور. كان نقاشًا بسيطًا لكنه ترك أثرًا كبيرًا.",
    media: {
      type: "image",
      source: "/images/event2.jpg",
    },
},
  {
    date: "٢ يونيو ٢٠٢٤",
    title: "يوم لا ينسى",
    description: "في هذا اليوم، كل شيء بدأ. أول رد منها على الستوري كان بداية أول تعارف بيننا. لحظة غيرت كل شيء.",
    media: {
      type: "image",
      source: "/images/event16.jpg", 
    },
  },
  {
    date: "٣ أغسطس ٢٠٢٤",
    title: "أول كليشة مني",
    description: "في هذا اليوم، أرسلت لها أول 'كليشة' تعبر عن مشاعري. كانت الكلمات خجولة، لكنها كانت بداية كل شيء جميل.",
    media: {
      type: "image",
      source: "/images/event5.jpg",
    },
  },
  {
    date: "١١ أغسطس ٢٠٢٤",
    title: "ذكرى ارتباطنا",
    description: "اليوم الذي أصبح فيه كل شيء رسميًا. بداية رحلتنا كشخصين يجمعهما الحب والوعد بمستقبلٍ معًا.",
    media: {
      type: "image",
      source: "/images/event3.jpg",
    },
  },
  {
    date: "١٨ أغسطس ٢٠٢٤",
    title: "أول مكالمة",
    description: "في تمام الساعة 10:42 مساءً، استمرت مكالمتنا 41 دقيقة و 22 ثانية. كان صوتها يجنن، وفي تلك اللحظات سمعت كلمة 'أحبك' التي غيرت كل شيء.",
    media: {
      type: "image",
      source: "/images/event4.jpg",
    },
  },
  {
    date: "١ ديسمبر ٢٠٢٤",
    title: "أول عيد ميلاد لها معي",
    description: "لمدة شهر كامل قبل هذا اليوم، كانت قناة التليجرام التي أنشأتها ترسل لها معايدة يومية. وفي يومها المميز، قدمت لها دبدوبًا ووردًا وكل الحب. كانت لحظة لا تقدر بثمن.",
    media: {
      type: "image",
      source:  "/images/sujood.jpg",
    },
  },
  {
    date: "٢٧ ديسمبر ٢٠٢٤",
    title: "أول عيد ميلاد لي معها",
    description: "أرسلت لي فيديو معايدة بصوتها الجميل الذي لا يغيب عن بالي، وكانت هديتها أغلى ما يكون: القرآن الكريم ومحفظة تحمل اسمي. يوم محفور في الذاكرة.",
    media: {
      type: "image",
      source: "/images/my-bday-video.jpg",
    },
  },
  {
    date: "١٤ فبراير ٢٠٢٥",
    title: "عيد الحب الأول",
    description: "فاجأتني بباقة ورد رائعة، وبدوري قدمت لها نظارات كهدية، ومعها أول رسالة أكتبها لها بخط يدي. يوم كلاسيكي مليء بالحب والمشاعر الصادقة.",
    media: {
      type: "image",
      source: "/images/valentine.jpg", // لا تنس إضافة صورة جديدة لهذا الحدث
    },
  },
];

export default events;